In [41]:
import pandas as pd
import numpy as np

In [42]:
student_names = ['Ivan', 'Slava', 'Alisa']
student_age = [20, 21, 19]
avg_score = [95, 87, 89]
df = pd.DataFrame({'Name': student_names, 'Age': student_age, 'Score': avg_score})
df

    Name  Age  Score
0   Ivan   20     95
1  Slava   21     87
2  Alisa   19     89

In [43]:
df[df['Score'] == df['Score'].max()]

   Name  Age  Score
0  Ivan   20     95

In [44]:
df['Age'].mean()

20.0

In [45]:
new_student = pd.Series({'Name': 'Valentin', 'Age': 22, 'Score': 93})
new_student

Name     Valentin
Age            22
Score          93
dtype: object

In [46]:
df = pd.concat([df, new_student.to_frame().T], ignore_index=True)
df

       Name Age Score
0      Ivan  20    95
1     Slava  21    87
2     Alisa  19    89
3  Valentin  22    93

In [47]:
df.loc[df['Name'] == 'Alisa', 'Age'] = 25
df

       Name Age Score
0      Ivan  20    95
1     Slava  21    87
2     Alisa  25    89
3  Valentin  22    93

In [48]:
df['Score'] = df['Score'].astype('int')

In [50]:
index_to_remove = df['Score'].idxmin()
df = df.drop(index_to_remove)
df

       Name Age  Score
0      Ivan  20     95
2     Alisa  25     89
3  Valentin  22     93

Загрузите данные из файла в DataFrame.

In [52]:
movies_df = pd.read_csv('data/movies.csv')
movies_df.head()

                             Название фильма  Год выпуска  Рейтинг IMDB
0  Звёздные войны: Эпизод IV – Новая надежда         1977           8.6
1                          Побег из Шоушенка         1994           9.3
2        Властелин колец: Возвращение короля         2003           8.9
3                               Форрест Гамп         1994           8.8
4                            Список Шиндлера         1993           8.9

Найдите фильм с наивысшим рейтингом.

In [53]:
best_movie = movies_df[movies_df['Рейтинг IMDB'] == movies_df['Рейтинг IMDB'].max()]
best_movie

     Название фильма  Год выпуска  Рейтинг IMDB
1  Побег из Шоушенка         1994           9.3

Посчитайте средний рейтинг по годам выпуска фильмов.

In [55]:
avg_rating = movies_df['Рейтинг IMDB'].mean()
avg_rating

8.819999999999999

: